const duasData = [
    {
        id: 1,
        text: "﴿ ربنا تقبل منا إنك أنت السميع العليم ﴾"
    },
    {
        id: 2,
        text: "﴿ ربنا واجعلنا مسلمين لك و من ذريتنا أمه مسلمة لك و أرنا مناسكنا و تب علينا إنك أنت التواب الرحيم ﴾"
    },
    {
        id: 3,
        text: "﴿ ربنا اتنا في الدنيا حسنة و في  الاخرة حسنة و قنا عذاب النار ﴾"
    },
    {
        id: 4,
        text: "﴿ ربنا أفرغ علينا صبرا وثبت أقدامنا وانصرنا على القوم الكافرين ﴾"
    },
    {
        id: 5,
        text: "﴿ ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين ﴾"
    },
    {
        id: 6,
        text: "﴿ ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب ﴾"
    },
    {
        id: 7,
        text: "﴿ ربنا إنك جامع الناس ليوم لا ريب فيه إن الله لا يخلف الميعاد ﴾"
    },
    {
        id: 8,
        text: "﴿ ربنا إننا آمنا فاغفر لنا ذنوبنا وقنا عذاب النار﴾"
    },
    {
        id: 9,
        text: "﴿ اللهم مالك الملك تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء بيدك الخير إنك على كل شيء قدير تولج الليل في النهار وتولج النهار في الليل وتخرج الحي من الميت وتخرج الميت من الحي وترزق من تشاء بغير حساب ﴾"
    },
    {
        id: 10,
        text: "﴿ رب هب لي من لدنك ذرية طيبة إنك سميع الدعاء ﴾"
    },
    {
        id: 11,
        text: "﴿ ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين ﴾"
    },
    {
        id: 12,
        text: "﴿ آمنا بالله وما أنزل علينا وما أنزل على إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط وما أوتي موسى وعيسى والنبيون من ربهم لا نفرق بين أحد منهم ونحن له مسلمون ﴾"
    },
    {
        id: 13,
        text: "﴿ ربنا اغفر لنا ذنوبنا وإسرافنا في أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين ﴾"
    },
    {
        id: 14,
        text: "﴿ حسبنا الله ونعم الوكيل ﴾"
    },
    {
        id: 15,
        text: "﴿ ربنا ما خلقت هذا باطلا سبحانك فقنا عذاب النار﴾"
    },
    {
        id: 16,
        text: "﴿ ربنا إنك من تدخل النار فقد أخزيته وما للظالمين من أنصار﴾"
    },
    {
        id: 17,
        text: "﴿ ربنا إننا سمعنا مناديا ينادي للإيمان أن آمنوا بربكم فآمنا ﴾"
    },
    {
        id: 18,
        text: "﴿ ربنا فاغفر لنا ذنوبنا وكفر عنا سيئاتنا وتوفنا مع الأبرار ﴾"
    },
    {
        id: 19,
        text: "﴿ ربنا وآتنا ما وعدتنا على رسلك ولا تخزنا يوم القيامة إنك لا تخلف الميعاد ﴾"
    },
    {
        id: 20,
        text: "﴿ ربنا أخرجنا من هذه القرية الظالم أهلها واجعل لنا من لدنك وليا واجعل لنا من لدنك نصيرا ﴾"
    },
    {
        id: 21,
        text: "﴿ ربنا آمنا فاكتبنا مع الشاهدين ﴾"
    },
    {
        id: 22,
        text: "﴿ وما لنا لا نؤمن بالله وما جاءنا من الحق ونطمع أن يدخلنا ربنا مع القوم الصالحين ﴾"
    },
    {
        id: 23,
        text: "﴿ إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين لا شريك له وبذلك أمرت وأنا أول المسلمين ﴾"
    },
    {
        id: 24,
        text: "﴿ ربنا لا تجعلنا مع القوم الظالمين ﴾"
    },
    {
        id: 25,
        text: "﴿ ربنا أفرغ علينا صبرا وتوفنا مسلمين ﴾"
    },
    {
        id: 26,
        text: "﴿ واكتب لنا في هذه الدنيا حسنة وفي الآخرة إنا هدنا إليك ﴾"
    },
    {
        id: 27,
        text: "﴿ حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم ﴾"
    },
    {
        id: 28,
        text: "﴿ على الله توكلنا ربنا لا تجعلنا فتنة للقوم الظالمين ﴾"
    },
    {
        id: 29,
        text: "﴿ ونجنا برحمتك من القوم الكافرين ﴾"
    },
    {
        id: 30,
        text: "﴿ ربنا إنك آتيت فرعون وملأه زينة وأموالا في الحياة الدنيا ربنا ليضلوا عن سبيلك ربنا اطمس على أموالهم واشدد على قلوبهم فلا يؤمنوا حتى يروا العذاب الأليم ﴾"
    },
    {
        id: 31,
        text: "﴿ رب إني أعوذ بك أن أسألك ما ليس لي به علم وإلا تغفر لي وترحمني أكن من الخاسرين ﴾"
    },
    {
        id: 32,
        text: "﴿ رب قد آتيتني من الملك وعلمتني من تأويل الأحاديث فاطر السماوات والأرض أنت وليي في الدنيا والآخرة توفني مسلما وألحقني بالصالحين ﴾"
    },
    {
        id: 33,
        text: "﴿ رب اجعل هذا البلد آمنا واجنبني وبني أن نعبد الأصنام ﴾"
    },
    {
        id: 34,
        text: "﴿ رب إنهن أضللن كثيرا من الناس فمن تبعني فإنه مني ومن عصاني فإنك غفور رحيم ﴾"
    },
    {
        id: 35,
        text: "﴿ ربنا إنك تعلم ما نخفي وما نعلن وما يخفى على الله من شيء في الأرض ولا في السماء ﴾"
    },
    {
        id: 36,
        text: "﴿ إن ربي لسميع الدعاء ﴾"
    },
    {
        id: 37,
        text: "﴿ رب اجعلني مقيم الصلاة ومن ذريتي ربنا وتقبل دعاء ﴾"
    },
    {
        id: 38,
        text: "﴿ ربنا اغفر لي ولوالدي وللمؤمنين يوم يقوم الحساب ﴾"
    },
    {
        id: 39,
        text: "﴿ رب أرحمهما كما ربياني صغيراً ﴾"
    },
    {
        id: 40,
        text: "﴿ رب زدني علما ﴾"
    },
    {
        id: 41,
        text: "﴿ أني مسنى الضر و أنت أرحم الرحمين ﴾"
    },
    {
        id: 42,
        text: "﴿ أن لا إله  إلا انت سبحانك إني كنت من الظالمين ﴾"
    },
    {
        id: 43,
        text: "﴿ رب لا تذرني فردا و أنت خير الوارثين ﴾"
    },
    {
        id: 44,
        text: "﴿ رب فلا تجعلني في القوم الظالمين  ﴾"
    },
    {
        id: 45,
        text: "﴿  رب أعوذ بك من همزات الشياطين وأعوذ بك رب أن يحضرون ﴾"
    },
    {
        id: 46,
        text: "﴿ ربناء امنا فاغفر لنا و ارحمنا وأنت خير الراحمين ﴾"
    },
    {
        id: 47,
        text: "﴿ رب أغفر و أرحم و أنت  خير  الراحمين ﴾"
    },
    {
        id: 48,
        text: "﴿ ربنا أصرف عنا عذاب جهنم إن عذابها كان غراما إنها ساءت مستقرا و مقاما﴾"
    },
    {
        id: 49,
        text: "﴿ ربنا هب لنا من أزواجنا وذرياتنا قرة أعين و اجعلنا للمتقين إماما ﴾"
    },
    {
        id: 50,
        text: "﴿ رب هب لي حكما وألحقني بالصالحين واجعل لي لسان صدق في الآخرين واجعلني من ورثة جنة النعيم ولا تخزني يوم يبعثون يوم لا ينفع مال ولا بنون  إلا من أتى الله بقلب سليم ﴾"
    },
    {
        id: 51,
        text: "﴿ فافتح بيني وبينهم فتحا ونجني ومن معي من المؤمنين ﴾"
    },
    {
        id: 52,
        text: "﴿ رب أوزعني أن أشكر نعمتك التي أنعمت على و على ولدي و أن اعمل صالحا ترضاه و أدخلني برحمتك في عبادك الصالحين ﴾"
    },
    {
        id: 53,
        text: "﴿ رب إني ظلمت نفسي فاغفر لي ﴾"
    },
    {
        id: 54,
        text: "﴿ رب نجني من القوم الظالمين ﴾"
    },
    {
        id: 55,
        text: "﴿ رب إني لما أنزلت إلي من خير فقير ﴾"
    },
    {
        id: 56,
        text: "﴿ رب انصرني على القوم المفسدين ﴾"
    },
    {
        id: 57,
        text: "﴿ الحمد لله الذي أذهب عنا الحزن إن ربنا لغفور شكور ﴾"
    },
    {
        id: 58,
        text: "﴿ رب هب لي من الصالحين ﴾"
    },
    {
        id: 59,
        text: "﴿ رب أغفر لي و هب لي  ملكاً لا ينبغي لأحد من بعدى أنك أنت الوهاب ﴾"
    },
    {
        id: 60,
        text: "﴿ أني مسني الشيطان بنصب وعذاب ﴾"
    },
    {
        id: 61,
        text: "﴿ اللهم فاطر السماوات والأرض عالم الغيب والشهادة أنت تحكم بين عبادك في ما كانوا فيه يختلفون ﴾"
    },
    {
        id: 62,
        text: "﴿ ربنا وسعت كل شيء رحمة وعلما فاغفر للذين تابوا واتبعوا سبيلك وقهم عذاب الجحيم ﴾"
    },
    {
        id: 63,
        text: "﴿ ربنا وأدخلهم جنات عدن التي وعدتهم ومن صلح من آبائهم وأزواجهم وذرياتهم إنك أنت العزيز الحكيم ﴾"
    },
    {
        id: 64,
        text: "﴿ وقهم السيئات ومن تق السيئات يومئذ فقد رحمته وذلك هو الفوز العظيم ﴾"
    },
    {
        id: 65,
        text: "﴿ رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأصلح لي في ذريتي إني تبت إليك وإني من المسلمين ﴾"
    },
    {
        id: 66,
        text: "﴿ أني مغلوب فانتصر ﴾"
    },
    {
        id: 67,
        text: "﴿ ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان ولا تجعل في قلوبنا غلا للذين آمنوا ربنا إنك رءوف رحيم ﴾"
    },
    {
        id: 68,
        text: "﴿ ربنا عليك توكلنا وإليك أنبنا وإليك المصير﴾"
    },
    {
        id: 69,
        text: "﴿ ربنا لا تجعلنا فتنة للذين كفروا واغفر لنا ربنا إنك أنت العزيز الحكيم ﴾"
    },
    {
        id: 70,
        text: "﴿ ربنا أتمم لنا نورنا و اغفر لنا إنك على كل شى قدير ﴾"
    },
    {
        id: 71,
        text: "﴿ رب اغفر لي ولوالدي ولمن دخل بيتي مؤمنا وللمؤمنين والمؤمنات ولا تزد الظالمين إلا تبارا ﴾"
    }
];
